# Aggregation and Groupby

Keep from your current content:

.groupby() basics

Aggregation functions (.mean(), .sum(), .count(), etc.)

.agg() with multiple functions

Your WHO data continent grouping example


What to add:

Multiple groupby columns

.transform() with groupby

.filter() with groupby

Named aggregations (pandas 0.25+)

Grouping with custom functions

.nlargest(), .nsmallest() per group


What to remove: Nothing major

In [2]:
import pandas as pd
import numpy as np

In [23]:
df = pd.read_csv("https://drive.google.com/uc?id=1oE-3rt17bFW7fOzDIjwFSEMPTIV3NvcO")

In [25]:
df[df["grade_math_t2"] > 10]

Empty DataFrame
Columns: [school_id, grade, class, student_id, sex, nationality, grade_math_t1, grade_language_t1, grade_science_t1, grade_math_t2, grade_language_t2, grade_science_t2, treatment, date_of_birth]
Index: []

In [24]:

df.dropna(inplace=True)


math_t2_mean = df[df["grade_math_t2"] <= 10]["grade_math_t2"].mean()
lang_t2_mean = df[df["grade_language_t2"] <= 10]["grade_language_t2"].mean()
science_t2_mean = df[df["grade_science_t2"] <= 10]["grade_science_t2"].mean()

df["grade_math_t2"] = df["grade_math_t2"].where(
    df["grade_math_t2"] <= 10, other=math_t2_mean
)
df["grade_language_t2"] = df["grade_language_t2"].where(
    df["grade_language_t2"] <= 10, other=lang_t2_mean
)
df["grade_science_t2"] = df["grade_science_t2"].where(
    df["grade_science_t2"] <= 10, other=science_t2_mean
)

df.describe()

,school_id,grade,sex,nationality,grade_math_t1,grade_language_t1,grade_science_t1,grade_math_t2,grade_language_t2,grade_science_t2,treatment
count,1503.000000,1503.000000,1503.000000,1503.000000,1503.000000,1503.000000,1503.000000,1503.000000,1503.000000,1503.000000,1503.000000
mean,458.220226,7.035263,1.203593,1.195609,6.654401,6.631813,6.644760,6.929468,6.906553,6.914589,0.501663
std,315.630762,0.817229,0.402804,0.396801,1.701947,1.711489,1.697327,1.946776,1.944566,1.922554,0.500164
min,57.000000,6.000000,1.000000,1.000000,0.000000,0.993821,0.000000,0.000000,0.000000,0.000000,0.000000
25%,141.000000,6.000000,1.000000,1.000000,5.563622,5.534540,5.472342,5.634017,5.603220,5.688546,0.000000
50%,458.000000,7.000000,1.000000,1.000000,6.834051,6.776043,6.757076,7.102169,7.055076,7.004282,1.000000
75%,812.000000,8.000000,1.000000,1.000000,7.945135,7.854883,7.927312,8.377333,8.356198,8.390638,1.000000
max,946.000000,8.000000,2.000000,2.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,1.000000

In [26]:
df.groupby("grade")["grade_math_t1"].mean()
df.groupby("grade", dropna=False)["grade_math_t2"].sum()

# When using .apply(), use group_keys to include or exclude the group keys.
df.groupby("grade", group_keys=False)["grade_language_t1"].apply(lambda x: x.mean()+2)

df.groupby("grade", dropna=False)["grade_math_t2"].count()

grade
6    476
7    498
8    529
Name: grade_math_t2, dtype: int64

In [28]:
df.groupby("grade")["grade_language_t2"].agg(["count", "mean", "sum", "std"])

       count      mean          sum       std
grade
6        476  6.828969  3250.589092  1.942778
7        498  6.998617  3485.311395  2.002472
8        529  6.889696  3644.649185  1.890254